app/controllers/admin_controller.rb

SELECT "books".* FROM "books"
---
  def books
    @books = Book.all.includes( :user )

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def show_book
    @book = Book.includes( :user ).find(params[:id])