app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."created_at" DESC
---
  def index
    @books = Book.all

UPDATE "books" SET "updated_at" = ?, "views" = ? WHERE "books"."id" = ?  [["updated_at", "2023-01-13 19:53:32.251918"], ["views", 1], ["id", 1]]
---
  def show
    @book.update(views: @book.views + 1)

INSERT INTO "books" ("title", "author", "discription", "created_at", "updated_at", "views", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "ffffff"], ["author", "ffffff"], ["discription", "ffffffffff"], ["created_at", "2023-01-14 04:12:07.538327"], ["updated_at", "2023-01-14 04:12:07.538327"], ["views", 0], ["user_id", 3]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "author" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["author", "Author 8 Who wrote this boobvmbvmbvk"], ["updated_at", "2023-01-14 23:29:47.625511"], ["id", 9]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)