app/controllers/users_controller.rb

  def profile
  @user.update(views: @user.views + 1)
---
UPDATE "users" SET "updated_at" = ?, "views" = ? WHERE "users"."id" = ?  [["updated_at", "2023-01-14 04:37:56.248701"], ["views", 1], ["id", 1]]